CSI API ETABS v1

# cAreaElm Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cAreaElm

    Public Interface cAreaElm

    Dim instance As cAreaElm

    public interface class cAreaElm

    type cAreaElm =  interface end

The cAreaElm type exposes the following members.

Methods

| Name| Description
---|---|---
|
Count|
|
GetLoadTemperature|
|
GetLoadUniform|
|
GetLocalAxes|
|
GetMaterialOverwrite|
|
GetModifiers|
|
GetNameList|
|
GetObj|
|
GetOffsets|
|
GetPoints|
|
GetProperty|
|
GetThickness|
| [GetTransformationMatrix](4307a2bb-
de1e-c04b-f42a-9b36f6329cdd.htm)|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com